# Turning to diffrent base

In [112]:
def intToBin(n):
    bits = []

    bits.append(str(0 if n%2 == 0 else 1))
    while n > 1:
        n = n // 2
        bits.append(str(0 if n%2 == 0 else 1))

    bits.reverse()
    return ''.join(bits)

In [113]:
def intToHexa(dec_value):
    ret_val = str()
    while dec_value > 0:
        hex_value=dec_value%16
        dec_value=dec_value//16
        ret_val = getHexChar(hex_value) + ret_val
    return ret_val

def getHexChar(dec_digit):
    if dec_digit < 10:
        return str(dec_digit)
    if dec_digit == 10:
        return "A"
    if dec_digit == 11:
        return "B"
    if dec_digit == 12:
        return "C"
    if dec_digit == 13:
        return "D"
    if dec_digit == 14:
        return "E"
    if dec_digit == 15:
        return "F"

In [126]:
def decToOctal(n):
 
    # array to store
    # octal number
    octalNum = [0] * 100
 
    # counter for octal
    # number array
    i = 0
    while (n != 0):
 
        # storing remainder
        # in octal array
        octalNum[i] = n % 8
        n = int(n / 8)
        i += 1
 
    # printing octal number
    # array in reverse order
    for j in range(i - 1, -1, -1):
        print(octalNum[j], end="")

In [139]:
print(intToBin(20))
print(intToHexa(45))
decToOctal(3333)

10100
2D
6405

# Pandas

In [143]:
import pandas as pd
cast = pd.read_csv(r'C:\Users\Alon\Desktop\קורסים\מדעי הנתונים\cast.csv')

In [ ]:
# How many movies have the title "Hamlet"?

In [166]:
cast[cast.title == 'Hamlet'].dropna().title.count()

234

In [ ]:
#List all of the "Treasure Island" movies from earliest to most recent

In [160]:
cast.where(cast.title == 'Treasure Island').dropna().sort_values(by='year')

,title,year,name,type,character,n
3046750,Treasure Island,1918.0,Violet Radcliffe,actress,Long John Silver,3.0
1801138,Treasure Island,1918.0,Lewis Sargent,actor,Ben Gunn,5.0
1587847,Treasure Island,1918.0,Lloyd Perl,actor,Black Dog,4.0
2454056,Treasure Island,1918.0,Virginia Lee Corbin,actress,Louise Trelawney,2.0
313097,Treasure Island,1918.0,Francis Carpenter,actor,Jim Hawkins,1.0
...,...,...,...,...,...,...
1828160,Treasure Island,1999.0,Dolph Scott,actor,Parker,11.0
866136,Treasure Island,1999.0,Pat Healy,actor,Clark,4.0
1075489,Treasure Island,1999.0,Scott King,actor,Walter,15.0
2649006,Treasure Island,1999.0,Daisy Hall,actress,Penny,8.0
807985,Treasure Island,1999.0,Paul Gutrecht,actor,Some Guy,20.0

In [ ]:
#How many roles were credited in the silent 1921 version of Hamlet?

In [171]:
cast[cast.title == 'Hamlet'].where(cast.year == 1921).dropna().character.count()

9

In [ ]:
#Use groupby() to plot the number of "Hamlet" films made each decade

In [230]:
int(1945.0 / 10) % 10

4

In [232]:
col = cast.year.apply(lambda x: int(x/10) % 10)
cast.insert(3, "decade", col)

In [242]:
cast[cast.title == 'Hamlet'].groupby(cast.decade).title.count()

decade
0    55
1    46
2     9
4    25
5     1
6    57
7    19
8     3
9    84
Name: title, dtype: int64

In [ ]:
# How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [288]:
cast[cast.decade == 5].where(cast.n == 1).groupby(['year', 'n', 'type']).count()

                    title  name  decade  character
year   n   type
1950.0 1.0 actor      604   604     604        604
           actress    271   271     271        271
1951.0 1.0 actor      633   633     633        633
           actress    272   272     272        272
1952.0 1.0 actor      591   591     591        591
           actress    284   284     284        284
1953.0 1.0 actor      634   634     634        634
           actress    290   290     290        290
1954.0 1.0 actor      626   626     626        626
           actress    298   298     298        298
1955.0 1.0 actor      606   606     606        606
           actress    264   264     264        264
1956.0 1.0 actor      614   614     614        614
           actress    288   288     288        288
1957.0 1.0 actor      708   708     708        708
           actress    284   284     284        284
1958.0 1.0 actor      694   694     694        694
           actress    275   275     275        275
1959.0 1.0 actor      678   678     678        678
           actress    287   287     287        287

In [ ]:
#List the 10 actors/actresses that have the most leading roles (n=1) since the 1990's.

In [281]:
cast[cast.year >= 1990].name.value_counts().head(10)

Jagathi Sreekumar    275
Eric Roberts         248
Brahmanandam         243
Anupam Kher          242
Shakti Kapoor        236
Gulshan Grover       227
Lloyd Kaufman        192
Paresh Rawal         184
Johnny Lever         184
Danny Trejo          180
Name: name, dtype: int64

In [ ]:
#List, in order by year, each of the films in which Frank Oz has played more than 1 role

In [310]:
c = cast[cast.name == 'Frank Oz']
d = c.groupby(['year','title']).size()
d[d > 1].sort_index()

year  title
1979  The Muppet Movie                            8
1981  An American Werewolf in London              2
      The Great Muppet Caper                      6
1982  The Dark Crystal                            2
1984  The Muppets Take Manhattan                  7
1985  Sesame Street Presents: Follow that Bird    3
1992  The Muppet Christmas Carol                  7
1996  Muppet Treasure Island                      4
1999  Muppets from Space                          4
      The Adventures of Elmo in Grouchland        3
dtype: int64